UKS/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <comment>Контрагенты</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование контрагента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УНН</name>
    <comment>Учетный номер налогоплательщика</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресОрганизации</name>
    <comment>Адрес организации</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <comment>Контактное лицо</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтактныеДанные</name>
    <comment>Контактные данные</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <comment>Почта</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Viber</name>
    <comment>Viber</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Skype</name>
    <comment>Skype</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

UKS/src/CommonForms/ФормаРассылка/Module.bsl
&НаКлиенте
Функция ПолучитьПрофильПочты()
	
	Профиль = Новый ИнтернетПочтовыйПрофиль; 
	Профиль.АдресСервераSMTP = АдресСервераSMTP;
	Профиль.ПортSMTP = ПортSMTP;
	Профиль.Пользователь = ПользовательSMTP;
	Профиль.Пароль = ПарольSMTP;
	Профиль.ПользовательSMTP = ПользовательSMTP;
	Профиль.ПарольSMTP = ПарольSMTP;
	Профиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
	Профиль.ИспользоватьSSLPOP3 = ИспользоватьSSLPOP3;
	Профиль.ИспользоватьSSLSMTP = ИспользоватьSSLSMTP;
	
	Возврат Профиль;
	
КонецФункции

&НаКлиенте
Функция ПолучитьСпискоПолучателей(Письмо) Экспорт
	
	Результат = "";
	
		
КонецФункции

&НаСервере
Процедура ЗаписатьЛогиОтправки(РезультатВыполнения)
	
	Для Каждого СтрокаВыполнения Из РезультатВыполнения Цикл
		
		ЗаписьЖурналаРегистрации("Почта.Рассылка",УровеньЖурналаРегистрации.Информация,,,СтрокаВыполнения);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	
	Почта = Новый ИнтернетПочта; 
	Почта.Подключиться(ПолучитьПрофильПочты());
	РезультатВыполнения = Новый Массив();
	
	Для каждого СтрокаТаблицы Из СписокКонтрагентов Цикл
		Если СтрокаТаблицы.Признак Тогда
			Если ЗначениеЗаполнено(СтрокаТаблицы.ПочтовыйЯщик) Тогда
				МассивАдресов = СтрРазделить(СтрокаТаблицы.ПочтовыйЯщик,";");
				Письмо = Новый ИнтернетПочтовоеСообщение;
				Текст = Письмо.Тексты.Добавить(ТекстСообщения); 
				Текст.ТипТекста = ТипТекстаПочтовогоСообщения.РазмеченныйТекст;
				Письмо.Тема = СокрЛП(ТемаПисьма); 
				Письмо.Отправитель = СокрЛП(ПользовательSMTP); 
				Письмо.ИмяОтправителя = СокрЛП(ИмяОтправителя);
				Для каждого ЭлементМассива Из МассивАдресов Цикл
					Письмо.Получатели.Добавить(ЭлементМассива);
				КонецЦикла;
				Попытка
					Почта.Послать(Письмо);
					РезультатВыполнения.Добавить("Письмо отправлено: "+СокрЛП(СтрокаТаблицы.Контрагент)+" ("+СокрЛП(ТемаПисьма)+")");
				Исключение 
					Сообщить(ОписаниеОшибки());
					РезультатВыполнения.Добавить(ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ЗаписатьЛогиОтправки(РезультатВыполнения);
	
	Предупреждение("Письмо отправлено",3);
	Почта.Отключиться();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьКонтрагентов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.НаименованиеПолное КАК НаименованиеПолное,
		|	Контрагенты.Email КАК Email,
		|	Контрагенты.Комментарий КАК Комментарий
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СписокКонтрагентов.Очистить();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = СписокКонтрагентов.Добавить();
		НоваяСтрока.Контрагент = ВыборкаДетальныеЗаписи.НаименованиеПолное;
		НоваяСтрока.ПочтовыйЯщик = ВыборкаДетальныеЗаписи.Email;
		НоваяСтрока.Комментарий = ВыборкаДетальныеЗаписи.Комментарий;
		НоваяСтрока.Признак = Ложь;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьНастройкиПочты()
	
	АдресСервераSMTP = ПрофильПочты.АдресСервераSMTP;
	ПортSMTP = ПрофильПочты.ПортSMTP;
	ПользовательSMTP = ПрофильПочты.ПользовательSMTP;
	ПарольSMTP = ПрофильПочты.ПарольSMTP;
	ИспользоватьSSLPOP3 = ПрофильПочты.ИспользоватьSSLPOP3;
	ИспользоватьSSLSMTP = ПрофильПочты.ИспользоватьSSLSMTP;
	ТекстСообщения = ПрофильПочты.ТекстПисьма;
	ТемаПисьма = ПрофильПочты.ТемаПисьма;
	ИмяОтправителя = ПрофильПочты.ИмяОтправителя;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗагрузитьКонтрагентов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрофильПочтыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПолучитьНастройкиПочты();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКонтрагенов(Команда)
	
	Получатели = "";
	ЗагрузитьКонтрагентов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПрофильПочтыПриИзменении(Элемент)
	ПолучитьНастройкиПочты();
КонецПроцедуры
